app/Models/CategoryModel.php

SELECT *
FROM `categories`
WHERE `userID` = '6'
ORDER BY `order` ASC
---
    public function selectCategories() {
        $this->session = \Config\Services::session();

        return $this->db->
        table('categories')->
        where('userID', $this->session->get('userID'))->
        orderby('order', 'ASC')->
        get()->getResultArray();

SELECT `order`
FROM `categories`
WHERE `userID` = '6'
ORDER BY `order` ASC
---
    public function selectOrder() {
        $this->session = \Config\Services::session();

        return $this->db->
        table('categories')->
        select('order')->
        where('userID', $this->session->get('userID'))->
        orderby('order', 'ASC')->
        get()->getRowArray();