app/Models/EntryModel.php

SELECT *
FROM `entries`
WHERE `userID` = '6'
AND `date` = '28.03.2023'
ORDER BY `order` ASC
---
    public function selectEntries() {
        $this->session = \Config\Services::session();

        return $this->db->
        table('entries')->
        where('userID', $this->session->get('userID'))->
        where('date', $this->session->get('selectedDate'))->
        orderby('order', 'ASC')->
        get()->getResultArray();