app/Models/StatisticsModel.php

    public function getDailyCategories($date) {
        $this->session = \Config\Services::session();

        return $this->db->
        table('entries')->
        select('designation')->
        where('userID', $this->session->get('userID'))->
        where('date', $date) ->
        orderby('order', 'ASC')->
        distinct()->
        get()->getResultArray();
---
SELECT DISTINCT `designation`
FROM `entries`
WHERE `userID` = '6'
AND `date` = '31.03.2023'
ORDER BY `order` ASC